In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import pyodbc

# Data Acquisition Lecture Notes

## Pandas objects

In [2]:
pd.Series([1, 2, 3])

0    1
1    2
2    3
dtype: int64

In [3]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [4]:
frame = pd.DataFrame({
    'col1': [1, 2, 4],
    'col2': [6, 7 , 10],
})

In [5]:
frame['col1']

0    1
1    2
2    4
Name: col1, dtype: int64

```python
frame[ [put a list here] ]
```

In [6]:
frame.index

RangeIndex(start=0, stop=3, step=1)

In [7]:
frame.index.values

array([0, 1, 2], dtype=int64)

## CSV

In [25]:
accidents = pd.read_csv("./data/accidents.csv")

In [26]:
accidents

  Miles from Home  % of Accidents
0     less than 1              23
1          1 to 5              29
2         6 to 10              17
3        11 to 15               8
4        16 to 20               6
5         over 20              17

In [24]:
accidents.dtypes

Miles from Home    object
% of Accidents      int64
dtype: object

In [33]:
accidents[2::2]

  Miles from Home  % of Accidents
2         6 to 10              17
4        16 to 20               6

In [34]:
accidents["Miles from Home"]

0    less than 1
1         1 to 5
2        6 to 10
3       11 to 15
4       16 to 20
5        over 20
Name: Miles from Home, dtype: object

In [35]:
accidents.shape

(6, 2)

In [36]:
accidents.head(3)

  Miles from Home  % of Accidents
0     less than 1              23
1          1 to 5              29
2         6 to 10              17

In [37]:
accidents.columns

Index(['Miles from Home', '% of Accidents'], dtype='object')

In [38]:
accidents.index

RangeIndex(start=0, stop=6, step=1)

## API

In [102]:
cats = pd.read_json('https://cataas.com/cat?json=true')

In [100]:
cats = pd.read_json('https://cataas.com/api/cats?limit=5')

In [103]:
cats

,id,created_at,tags,url
0,62688214a9716a001738b882,2022-04-26 23:36:52.182000+00:00,Cat,/cat/62688214a9716a001738b882
1,62688214a9716a001738b882,2022-04-26 23:36:52.182000+00:00,Sniper,/cat/62688214a9716a001738b882
2,62688214a9716a001738b882,2022-04-26 23:36:52.182000+00:00,Scout,/cat/62688214a9716a001738b882

In [105]:
url = 'https://cataas.com/' + cats['url'][0]
plt.

'/cat/62688214a9716a001738b882'

## SLQ

In [4]:
pd.read_sql('data/db.sqlite3',con=)

TypeError: read_sql() missing 1 required positional argument: 'con'